CLIP(
  (visual): VisionTransformer(
    (conv1): Conv2d(3, 1024, kernel_size=(14, 14), stride=(14, 14), bias=False)
    (ln_pre): LayerNorm((1024,), eps=1e-05, elementwise_affine=True)
    (transformer): Transformer(
      (resblocks): Sequential(
        (0): ResidualAttentionBlock(
          (attn): MultiheadAttention(
            (out_proj): NonDynamicallyQuantizableLinear(in_features=1024, out_features=1024, bias=True)
          )
          (ln_1): LayerNorm((1024,), eps=1e-05, elementwise_affine=True)
          (mlp): Sequential(
            (c_fc): Linear(in_features=1024, out_features=4096, bias=True)
            (gelu): QuickGELU()
            (c_proj): Linear(in_features=4096, out_features=1024, bias=True)
          )
          (ln_2): LayerNorm((1024,), eps=1e-05, elementwise_affine=True)
        )
        (1): ResidualAttentionBlock(
          (attn): MultiheadAttention(
            (out_proj): NonDynamicallyQuantizableLinear(in_features=1024, out_features=1024, bias=True)
          )
          (ln_1): LayerNorm((1024,), eps=1e-05, elementwise_affine=True)
          (mlp): Sequential(
            (c_fc): Linear(in_features=1024, out_features=4096, bias=True)
            (gelu): QuickGELU()
            (c_proj): Linear(in_features=4096, out_features=1024, bias=True)
          )
          (ln_2): LayerNorm((1024,), eps=1e-05, elementwise_affine=True)
        )
        (2): ResidualAttentionBlock(
          (attn): MultiheadAttention(
            (out_proj): NonDynamicallyQuantizableLinear(in_features=1024, out_features=1024, bias=True)
          )
          (ln_1): LayerNorm((1024,), eps=1e-05, elementwise_affine=True)
          (mlp): Sequential(
            (c_fc): Linear(in_features=1024, out_features=4096, bias=True)
            (gelu): QuickGELU()
            (c_proj): Linear(in_features=4096, out_features=1024, bias=True)
          )
          (ln_2): LayerNorm((1024,), eps=1e-05, elementwise_affine=True)
        )
        (3): ResidualAttentionBlock(
          (attn): MultiheadAttention(
            (out_proj): NonDynamicallyQuantizableLinear(in_features=1024, out_features=1024, bias=True)
          )
          (ln_1): LayerNorm((1024,), eps=1e-05, elementwise_affine=True)
          (mlp): Sequential(
            (c_fc): Linear(in_features=1024, out_features=4096, bias=True)
            (gelu): QuickGELU()
            (c_proj): Linear(in_features=4096, out_features=1024, bias=True)
          )
          (ln_2): LayerNorm((1024,), eps=1e-05, elementwise_affine=True)
        )
        (4): ResidualAttentionBlock(
          (attn): MultiheadAttention(
            (out_proj): NonDynamicallyQuantizableLinear(in_features=1024, out_features=1024, bias=True)
          )
          (ln_1): LayerNorm((1024,), eps=1e-05, elementwise_affine=True)
          (mlp): Sequential(
            (c_fc): Linear(in_features=1024, out_features=4096, bias=True)
            (gelu): QuickGELU()
            (c_proj): Linear(in_features=4096, out_features=1024, bias=True)
          )
          (ln_2): LayerNorm((1024,), eps=1e-05, elementwise_affine=True)
        )
        (5): ResidualAttentionBlock(
          (attn): MultiheadAttention(
            (out_proj): NonDynamicallyQuantizableLinear(in_features=1024, out_features=1024, bias=True)
          )
          (ln_1): LayerNorm((1024,), eps=1e-05, elementwise_affine=True)
          (mlp): Sequential(
            (c_fc): Linear(in_features=1024, out_features=4096, bias=True)
            (gelu): QuickGELU()
            (c_proj): Linear(in_features=4096, out_features=1024, bias=True)
          )
          (ln_2): LayerNorm((1024,), eps=1e-05, elementwise_affine=True)
        )
        (6): ResidualAttentionBlock(
          (attn): MultiheadAttention(
            (out_proj): NonDynamicallyQuantizableLinear(in_features=1024, out_features=1024, bias=True)
          )
          (ln_1): LayerNorm((1024,), eps=1e-05, elementwise_affine=True)
          (mlp): Sequential(
            (c_fc): Linear(in_features=1024, out_features=4096, bias=True)
            (gelu): QuickGELU()
            (c_proj): Linear(in_features=4096, out_features=1024, bias=True)
          )
          (ln_2): LayerNorm((1024,), eps=1e-05, elementwise_affine=True)
        )
        (7): ResidualAttentionBlock(
          (attn): MultiheadAttention(
            (out_proj): NonDynamicallyQuantizableLinear(in_features=1024, out_features=1024, bias=True)
          )
          (ln_1): LayerNorm((1024,), eps=1e-05, elementwise_affine=True)
          (mlp): Sequential(
            (c_fc): Linear(in_features=1024, out_features=4096, bias=True)
            (gelu): QuickGELU()
            (c_proj): Linear(in_features=4096, out_features=1024, bias=True)
          )
          (ln_2): LayerNorm((1024,), eps=1e-05, elementwise_affine=True)
        )
        (8): ResidualAttentionBlock(
          (attn): MultiheadAttention(
            (out_proj): NonDynamicallyQuantizableLinear(in_features=1024, out_features=1024, bias=True)
          )
          (ln_1): LayerNorm((1024,), eps=1e-05, elementwise_affine=True)
          (mlp): Sequential(
            (c_fc): Linear(in_features=1024, out_features=4096, bias=True)
            (gelu): QuickGELU()
            (c_proj): Linear(in_features=4096, out_features=1024, bias=True)
          )
          (ln_2): LayerNorm((1024,), eps=1e-05, elementwise_affine=True)
        )
        (9): ResidualAttentionBlock(
          (attn): MultiheadAttention(
            (out_proj): NonDynamicallyQuantizableLinear(in_features=1024, out_features=1024, bias=True)
          )
          (ln_1): LayerNorm((1024,), eps=1e-05, elementwise_affine=True)
          (mlp): Sequential(
            (c_fc): Linear(in_features=1024, out_features=4096, bias=True)
            (gelu): QuickGELU()
            (c_proj): Linear(in_features=4096, out_features=1024, bias=True)
          )
          (ln_2): LayerNorm((1024,), eps=1e-05, elementwise_affine=True)
        )
        (10): ResidualAttentionBlock(
          (attn): MultiheadAttention(
            (out_proj): NonDynamicallyQuantizableLinear(in_features=1024, out_features=1024, bias=True)
          )
          (ln_1): LayerNorm((1024,), eps=1e-05, elementwise_affine=True)
          (mlp): Sequential(
            (c_fc): Linear(in_features=1024, out_features=4096, bias=True)
            (gelu): QuickGELU()
            (c_proj): Linear(in_features=4096, out_features=1024, bias=True)
          )
          (ln_2): LayerNorm((1024,), eps=1e-05, elementwise_affine=True)
        )
        (11): ResidualAttentionBlock(
          (attn): MultiheadAttention(
            (out_proj): NonDynamicallyQuantizableLinear(in_features=1024, out_features=1024, bias=True)
          )
          (ln_1): LayerNorm((1024,), eps=1e-05, elementwise_affine=True)
          (mlp): Sequential(
            (c_fc): Linear(in_features=1024, out_features=4096, bias=True)
            (gelu): QuickGELU()
            (c_proj): Linear(in_features=4096, out_features=1024, bias=True)
          )
          (ln_2): LayerNorm((1024,), eps=1e-05, elementwise_affine=True)
        )
        (12): ResidualAttentionBlock(
          (attn): MultiheadAttention(
            (out_proj): NonDynamicallyQuantizableLinear(in_features=1024, out_features=1024, bias=True)
          )
          (ln_1): LayerNorm((1024,), eps=1e-05, elementwise_affine=True)
          (mlp): Sequential(
            (c_fc): Linear(in_features=1024, out_features=4096, bias=True)
            (gelu): QuickGELU()
            (c_proj): Linear(in_features=4096, out_features=1024, bias=True)
          )
          (ln_2): LayerNorm((1024,), eps=1e-05, elementwise_affine=True)
        )
        (13): ResidualAttentionBlock(
          (attn): MultiheadAttention(
            (out_proj): NonDynamicallyQuantizableLinear(in_features=1024, out_features=1024, bias=True)
          )
          (ln_1): LayerNorm((1024,), eps=1e-05, elementwise_affine=True)
          (mlp): Sequential(
            (c_fc): Linear(in_features=1024, out_features=4096, bias=True)
            (gelu): QuickGELU()
            (c_proj): Linear(in_features=4096, out_features=1024, bias=True)
          )
          (ln_2): LayerNorm((1024,), eps=1e-05, elementwise_affine=True)
        )
        (14): ResidualAttentionBlock(
          (attn): MultiheadAttention(
            (out_proj): NonDynamicallyQuantizableLinear(in_features=1024, out_features=1024, bias=True)
          )
          (ln_1): LayerNorm((1024,), eps=1e-05, elementwise_affine=True)
          (mlp): Sequential(
            (c_fc): Linear(in_features=1024, out_features=4096, bias=True)
            (gelu): QuickGELU()
            (c_proj): Linear(in_features=4096, out_features=1024, bias=True)
          )
          (ln_2): LayerNorm((1024,), eps=1e-05, elementwise_affine=True)
        )
        (15): ResidualAttentionBlock(
          (attn): MultiheadAttention(
            (out_proj): NonDynamicallyQuantizableLinear(in_features=1024, out_features=1024, bias=True)
          )
          (ln_1): LayerNorm((1024,), eps=1e-05, elementwise_affine=True)
          (mlp): Sequential(
            (c_fc): Linear(in_features=1024, out_features=4096, bias=True)
            (gelu): QuickGELU()
            (c_proj): Linear(in_features=4096, out_features=1024, bias=True)
          )
          (ln_2): LayerNorm((1024,), eps=1e-05, elementwise_affine=True)
        )
        (16): ResidualAttentionBlock(
          (attn): MultiheadAttention(
            (out_proj): NonDynamicallyQuantizableLinear(in_features=1024, out_features=1024, bias=True)
          )
          (ln_1): LayerNorm((1024,), eps=1e-05, elementwise_affine=True)
          (mlp): Sequential(
            (c_fc): Linear(in_features=1024, out_features=4096, bias=True)
            (gelu): QuickGELU()
            (c_proj): Linear(in_features=4096, out_features=1024, bias=True)
          )
          (ln_2): LayerNorm((1024,), eps=1e-05, elementwise_affine=True)
        )
        (17): ResidualAttentionBlock(
          (attn): MultiheadAttention(
            (out_proj): NonDynamicallyQuantizableLinear(in_features=1024, out_features=1024, bias=True)
          )
          (ln_1): LayerNorm((1024,), eps=1e-05, elementwise_affine=True)
          (mlp): Sequential(
            (c_fc): Linear(in_features=1024, out_features=4096, bias=True)
            (gelu): QuickGELU()
            (c_proj): Linear(in_features=4096, out_features=1024, bias=True)
          )
          (ln_2): LayerNorm((1024,), eps=1e-05, elementwise_affine=True)
        )
        (18): ResidualAttentionBlock(
          (attn): MultiheadAttention(
            (out_proj): NonDynamicallyQuantizableLinear(in_features=1024, out_features=1024, bias=True)
          )
          (ln_1): LayerNorm((1024,), eps=1e-05, elementwise_affine=True)
          (mlp): Sequential(
            (c_fc): Linear(in_features=1024, out_features=4096, bias=True)
            (gelu): QuickGELU()
            (c_proj): Linear(in_features=4096, out_features=1024, bias=True)
          )
          (ln_2): LayerNorm((1024,), eps=1e-05, elementwise_affine=True)
        )
        (19): ResidualAttentionBlock(
          (attn): MultiheadAttention(
            (out_proj): NonDynamicallyQuantizableLinear(in_features=1024, out_features=1024, bias=True)
          )
          (ln_1): LayerNorm((1024,), eps=1e-05, elementwise_affine=True)
          (mlp): Sequential(
            (c_fc): Linear(in_features=1024, out_features=4096, bias=True)
            (gelu): QuickGELU()
            (c_proj): Linear(in_features=4096, out_features=1024, bias=True)
          )
          (ln_2): LayerNorm((1024,), eps=1e-05, elementwise_affine=True)
        )
        (20): ResidualAttentionBlock(
          (attn): MultiheadAttention(
            (out_proj): NonDynamicallyQuantizableLinear(in_features=1024, out_features=1024, bias=True)
          )
          (ln_1): LayerNorm((1024,), eps=1e-05, elementwise_affine=True)
          (mlp): Sequential(
            (c_fc): Linear(in_features=1024, out_features=4096, bias=True)
            (gelu): QuickGELU()
            (c_proj): Linear(in_features=4096, out_features=1024, bias=True)
          )
          (ln_2): LayerNorm((1024,), eps=1e-05, elementwise_affine=True)
        )
        (21): ResidualAttentionBlock(
          (attn): MultiheadAttention(
            (out_proj): NonDynamicallyQuantizableLinear(in_features=1024, out_features=1024, bias=True)
          )
          (ln_1): LayerNorm((1024,), eps=1e-05, elementwise_affine=True)
          (mlp): Sequential(
            (c_fc): Linear(in_features=1024, out_features=4096, bias=True)
            (gelu): QuickGELU()
            (c_proj): Linear(in_features=4096, out_features=1024, bias=True)
          )
          (ln_2): LayerNorm((1024,), eps=1e-05, elementwise_affine=True)
        )
        (22): ResidualAttentionBlock(
          (attn): MultiheadAttention(
            (out_proj): NonDynamicallyQuantizableLinear(in_features=1024, out_features=1024, bias=True)
          )
          (ln_1): LayerNorm((1024,), eps=1e-05, elementwise_affine=True)
          (mlp): Sequential(
            (c_fc): Linear(in_features=1024, out_features=4096, bias=True)
            (gelu): QuickGELU()
            (c_proj): Linear(in_features=4096, out_features=1024, bias=True)
          )
          (ln_2): LayerNorm((1024,), eps=1e-05, elementwise_affine=True)
        )
        (23): ResidualAttentionBlock(
          (attn): MultiheadAttention(
            (out_proj): NonDynamicallyQuantizableLinear(in_features=1024, out_features=1024, bias=True)
          )
          (ln_1): LayerNorm((1024,), eps=1e-05, elementwise_affine=True)
          (mlp): Sequential(
            (c_fc): Linear(in_features=1024, out_features=4096, bias=True)
            (gelu): QuickGELU()
            (c_proj): Linear(in_features=4096, out_features=1024, bias=True)
          )
          (ln_2): LayerNorm((1024,), eps=1e-05, elementwise_affine=True)
        )
      )
    )
    (ln_post): LayerNorm((1024,), eps=1e-05, elementwise_affine=True)
  )
  (transformer): Transformer(
    (resblocks): Sequential(
      (0): ResidualAttentionBlock(
        (attn): MultiheadAttention(
          (out_proj): NonDynamicallyQuantizableLinear(in_features=768, out_features=768, bias=True)
        )
        (ln_1): LayerNorm((768,), eps=1e-05, elementwise_affine=True)
        (mlp): Sequential(
          (c_fc): Linear(in_features=768, out_features=3072, bias=True)
          (gelu): QuickGELU()
          (c_proj): Linear(in_features=3072, out_features=768, bias=True)
        )
        (ln_2): LayerNorm((768,), eps=1e-05, elementwise_affine=True)
      )
      (1): ResidualAttentionBlock(
        (attn): MultiheadAttention(
          (out_proj): NonDynamicallyQuantizableLinear(in_features=768, out_features=768, bias=True)
        )
        (ln_1): LayerNorm((768,), eps=1e-05, elementwise_affine=True)
        (mlp): Sequential(
          (c_fc): Linear(in_features=768, out_features=3072, bias=True)
          (gelu): QuickGELU()
          (c_proj): Linear(in_features=3072, out_features=768, bias=True)
        )
        (ln_2): LayerNorm((768,), eps=1e-05, elementwise_affine=True)
      )
      (2): ResidualAttentionBlock(
        (attn): MultiheadAttention(
          (out_proj): NonDynamicallyQuantizableLinear(in_features=768, out_features=768, bias=True)
        )
        (ln_1): LayerNorm((768,), eps=1e-05, elementwise_affine=True)
        (mlp): Sequential(
          (c_fc): Linear(in_features=768, out_features=3072, bias=True)
          (gelu): QuickGELU()
          (c_proj): Linear(in_features=3072, out_features=768, bias=True)
        )
        (ln_2): LayerNorm((768,), eps=1e-05, elementwise_affine=True)
      )
      (3): ResidualAttentionBlock(
        (attn): MultiheadAttention(
          (out_proj): NonDynamicallyQuantizableLinear(in_features=768, out_features=768, bias=True)
        )
        (ln_1): LayerNorm((768,), eps=1e-05, elementwise_affine=True)
        (mlp): Sequential(
          (c_fc): Linear(in_features=768, out_features=3072, bias=True)
          (gelu): QuickGELU()
          (c_proj): Linear(in_features=3072, out_features=768, bias=True)
        )
        (ln_2): LayerNorm((768,), eps=1e-05, elementwise_affine=True)
      )
      (4): ResidualAttentionBlock(
        (attn): MultiheadAttention(
          (out_proj): NonDynamicallyQuantizableLinear(in_features=768, out_features=768, bias=True)
        )
        (ln_1): LayerNorm((768,), eps=1e-05, elementwise_affine=True)
        (mlp): Sequential(
          (c_fc): Linear(in_features=768, out_features=3072, bias=True)
          (gelu): QuickGELU()
          (c_proj): Linear(in_features=3072, out_features=768, bias=True)
        )
        (ln_2): LayerNorm((768,), eps=1e-05, elementwise_affine=True)
      )
      (5): ResidualAttentionBlock(
        (attn): MultiheadAttention(
          (out_proj): NonDynamicallyQuantizableLinear(in_features=768, out_features=768, bias=True)
        )
        (ln_1): LayerNorm((768,), eps=1e-05, elementwise_affine=True)
        (mlp): Sequential(
          (c_fc): Linear(in_features=768, out_features=3072, bias=True)
          (gelu): QuickGELU()
          (c_proj): Linear(in_features=3072, out_features=768, bias=True)
        )
        (ln_2): LayerNorm((768,), eps=1e-05, elementwise_affine=True)
      )
      (6): ResidualAttentionBlock(
        (attn): MultiheadAttention(
          (out_proj): NonDynamicallyQuantizableLinear(in_features=768, out_features=768, bias=True)
        )
        (ln_1): LayerNorm((768,), eps=1e-05, elementwise_affine=True)
        (mlp): Sequential(
          (c_fc): Linear(in_features=768, out_features=3072, bias=True)
          (gelu): QuickGELU()
          (c_proj): Linear(in_features=3072, out_features=768, bias=True)
        )
        (ln_2): LayerNorm((768,), eps=1e-05, elementwise_affine=True)
      )
      (7): ResidualAttentionBlock(
        (attn): MultiheadAttention(
          (out_proj): NonDynamicallyQuantizableLinear(in_features=768, out_features=768, bias=True)
        )
        (ln_1): LayerNorm((768,), eps=1e-05, elementwise_affine=True)
        (mlp): Sequential(
          (c_fc): Linear(in_features=768, out_features=3072, bias=True)
          (gelu): QuickGELU()
          (c_proj): Linear(in_features=3072, out_features=768, bias=True)
        )
        (ln_2): LayerNorm((768,), eps=1e-05, elementwise_affine=True)
      )
      (8): ResidualAttentionBlock(
        (attn): MultiheadAttention(
          (out_proj): NonDynamicallyQuantizableLinear(in_features=768, out_features=768, bias=True)
        )
        (ln_1): LayerNorm((768,), eps=1e-05, elementwise_affine=True)
        (mlp): Sequential(
          (c_fc): Linear(in_features=768, out_features=3072, bias=True)
          (gelu): QuickGELU()
          (c_proj): Linear(in_features=3072, out_features=768, bias=True)
        )
        (ln_2): LayerNorm((768,), eps=1e-05, elementwise_affine=True)
      )
      (9): ResidualAttentionBlock(
        (attn): MultiheadAttention(
          (out_proj): NonDynamicallyQuantizableLinear(in_features=768, out_features=768, bias=True)
        )
        (ln_1): LayerNorm((768,), eps=1e-05, elementwise_affine=True)
        (mlp): Sequential(
          (c_fc): Linear(in_features=768, out_features=3072, bias=True)
          (gelu): QuickGELU()
          (c_proj): Linear(in_features=3072, out_features=768, bias=True)
        )
        (ln_2): LayerNorm((768,), eps=1e-05, elementwise_affine=True)
      )
      (10): ResidualAttentionBlock(
        (attn): MultiheadAttention(
          (out_proj): NonDynamicallyQuantizableLinear(in_features=768, out_features=768, bias=True)
        )
        (ln_1): LayerNorm((768,), eps=1e-05, elementwise_affine=True)
        (mlp): Sequential(
          (c_fc): Linear(in_features=768, out_features=3072, bias=True)
          (gelu): QuickGELU()
          (c_proj): Linear(in_features=3072, out_features=768, bias=True)
        )
        (ln_2): LayerNorm((768,), eps=1e-05, elementwise_affine=True)
      )
      (11): ResidualAttentionBlock(
        (attn): MultiheadAttention(
          (out_proj): NonDynamicallyQuantizableLinear(in_features=768, out_features=768, bias=True)
        )
        (ln_1): LayerNorm((768,), eps=1e-05, elementwise_affine=True)
        (mlp): Sequential(
          (c_fc): Linear(in_features=768, out_features=3072, bias=True)
          (gelu): QuickGELU()
          (c_proj): Linear(in_features=3072, out_features=768, bias=True)
        )
        (ln_2): LayerNorm((768,), eps=1e-05, elementwise_affine=True)
      )
    )
  )
  (token_embedding): Embedding(49408, 768)
  (ln_final): LayerNorm((768,), eps=1e-05, elementwise_affine=True)
)
positional_embedding torch.Size([77, 768])
text_projection torch.Size([768, 768])
logit_scale torch.Size([])
visual.class_embedding torch.Size([1024])
visual.positional_embedding torch.Size([257, 1024])
visual.proj torch.Size([1024, 768])
visual.conv1.weight torch.Size([1024, 3, 14, 14])
visual.ln_pre.weight torch.Size([1024])
visual.ln_pre.bias torch.Size([1024])
visual.transformer.resblocks.0.attn.in_proj_weight torch.Size([3072, 1024])
visual.transformer.resblocks.0.attn.in_proj_bias torch.Size([3072])
visual.transformer.resblocks.0.attn.out_proj.weight torch.Size([1024, 1024])
visual.transformer.resblocks.0.attn.out_proj.bias torch.Size([1024])
visual.transformer.resblocks.0.ln_1.weight torch.Size([1024])
visual.transformer.resblocks.0.ln_1.bias torch.Size([1024])
visual.transformer.resblocks.0.mlp.c_fc.weight torch.Size([4096, 1024])
visual.transformer.resblocks.0.mlp.c_fc.bias torch.Size([4096])
visual.transformer.resblocks.0.mlp.c_proj.weight torch.Size([1024, 4096])
visual.transformer.resblocks.0.mlp.c_proj.bias torch.Size([1024])
visual.transformer.resblocks.0.ln_2.weight torch.Size([1024])
visual.transformer.resblocks.0.ln_2.bias torch.Size([1024])
visual.transformer.resblocks.1.attn.in_proj_weight torch.Size([3072, 1024])
visual.transformer.resblocks.1.attn.in_proj_bias torch.Size([3072])
visual.transformer.resblocks.1.attn.out_proj.weight torch.Size([1024, 1024])
visual.transformer.resblocks.1.attn.out_proj.bias torch.Size([1024])
visual.transformer.resblocks.1.ln_1.weight torch.Size([1024])
visual.transformer.resblocks.1.ln_1.bias torch.Size([1024])
visual.transformer.resblocks.1.mlp.c_fc.weight torch.Size([4096, 1024])
visual.transformer.resblocks.1.mlp.c_fc.bias torch.Size([4096])
visual.transformer.resblocks.1.mlp.c_proj.weight torch.Size([1024, 4096])
visual.transformer.resblocks.1.mlp.c_proj.bias torch.Size([1024])
visual.transformer.resblocks.1.ln_2.weight torch.Size([1024])
visual.transformer.resblocks.1.ln_2.bias torch.Size([1024])
visual.transformer.resblocks.2.attn.in_proj_weight torch.Size([3072, 1024])
visual.transformer.resblocks.2.attn.in_proj_bias torch.Size([3072])
visual.transformer.resblocks.2.attn.out_proj.weight torch.Size([1024, 1024])
visual.transformer.resblocks.2.attn.out_proj.bias torch.Size([1024])
visual.transformer.resblocks.2.ln_1.weight torch.Size([1024])
visual.transformer.resblocks.2.ln_1.bias torch.Size([1024])
visual.transformer.resblocks.2.mlp.c_fc.weight torch.Size([4096, 1024])
visual.transformer.resblocks.2.mlp.c_fc.bias torch.Size([4096])
visual.transformer.resblocks.2.mlp.c_proj.weight torch.Size([1024, 4096])
visual.transformer.resblocks.2.mlp.c_proj.bias torch.Size([1024])
visual.transformer.resblocks.2.ln_2.weight torch.Size([1024])
visual.transformer.resblocks.2.ln_2.bias torch.Size([1024])
visual.transformer.resblocks.3.attn.in_proj_weight torch.Size([3072, 1024])
visual.transformer.resblocks.3.attn.in_proj_bias torch.Size([3072])
visual.transformer.resblocks.3.attn.out_proj.weight torch.Size([1024, 1024])
visual.transformer.resblocks.3.attn.out_proj.bias torch.Size([1024])
visual.transformer.resblocks.3.ln_1.weight torch.Size([1024])
visual.transformer.resblocks.3.ln_1.bias torch.Size([1024])
visual.transformer.resblocks.3.mlp.c_fc.weight torch.Size([4096, 1024])
visual.transformer.resblocks.3.mlp.c_fc.bias torch.Size([4096])
visual.transformer.resblocks.3.mlp.c_proj.weight torch.Size([1024, 4096])
visual.transformer.resblocks.3.mlp.c_proj.bias torch.Size([1024])
visual.transformer.resblocks.3.ln_2.weight torch.Size([1024])
visual.transformer.resblocks.3.ln_2.bias torch.Size([1024])
visual.transformer.resblocks.4.attn.in_proj_weight torch.Size([3072, 1024])
visual.transformer.resblocks.4.attn.in_proj_bias torch.Size([3072])
visual.transformer.resblocks.4.attn.out_proj.weight torch.Size([1024, 1024])
visual.transformer.resblocks.4.attn.out_proj.bias torch.Size([1024])
visual.transformer.resblocks.4.ln_1.weight torch.Size([1024])
visual.transformer.resblocks.4.ln_1.bias torch.Size([1024])
visual.transformer.resblocks.4.mlp.c_fc.weight torch.Size([4096, 1024])
visual.transformer.resblocks.4.mlp.c_fc.bias torch.Size([4096])
visual.transformer.resblocks.4.mlp.c_proj.weight torch.Size([1024, 4096])
visual.transformer.resblocks.4.mlp.c_proj.bias torch.Size([1024])
visual.transformer.resblocks.4.ln_2.weight torch.Size([1024])
visual.transformer.resblocks.4.ln_2.bias torch.Size([1024])
visual.transformer.resblocks.5.attn.in_proj_weight torch.Size([3072, 1024])
visual.transformer.resblocks.5.attn.in_proj_bias torch.Size([3072])
visual.transformer.resblocks.5.attn.out_proj.weight torch.Size([1024, 1024])
visual.transformer.resblocks.5.attn.out_proj.bias torch.Size([1024])
visual.transformer.resblocks.5.ln_1.weight torch.Size([1024])
visual.transformer.resblocks.5.ln_1.bias torch.Size([1024])
visual.transformer.resblocks.5.mlp.c_fc.weight torch.Size([4096, 1024])
visual.transformer.resblocks.5.mlp.c_fc.bias torch.Size([4096])
visual.transformer.resblocks.5.mlp.c_proj.weight torch.Size([1024, 4096])
visual.transformer.resblocks.5.mlp.c_proj.bias torch.Size([1024])
visual.transformer.resblocks.5.ln_2.weight torch.Size([1024])
visual.transformer.resblocks.5.ln_2.bias torch.Size([1024])
visual.transformer.resblocks.6.attn.in_proj_weight torch.Size([3072, 1024])
visual.transformer.resblocks.6.attn.in_proj_bias torch.Size([3072])
visual.transformer.resblocks.6.attn.out_proj.weight torch.Size([1024, 1024])
visual.transformer.resblocks.6.attn.out_proj.bias torch.Size([1024])
visual.transformer.resblocks.6.ln_1.weight torch.Size([1024])
visual.transformer.resblocks.6.ln_1.bias torch.Size([1024])
visual.transformer.resblocks.6.mlp.c_fc.weight torch.Size([4096, 1024])
visual.transformer.resblocks.6.mlp.c_fc.bias torch.Size([4096])
visual.transformer.resblocks.6.mlp.c_proj.weight torch.Size([1024, 4096])
visual.transformer.resblocks.6.mlp.c_proj.bias torch.Size([1024])
visual.transformer.resblocks.6.ln_2.weight torch.Size([1024])
visual.transformer.resblocks.6.ln_2.bias torch.Size([1024])
visual.transformer.resblocks.7.attn.in_proj_weight torch.Size([3072, 1024])
visual.transformer.resblocks.7.attn.in_proj_bias torch.Size([3072])
visual.transformer.resblocks.7.attn.out_proj.weight torch.Size([1024, 1024])
visual.transformer.resblocks.7.attn.out_proj.bias torch.Size([1024])
visual.transformer.resblocks.7.ln_1.weight torch.Size([1024])
visual.transformer.resblocks.7.ln_1.bias torch.Size([1024])
visual.transformer.resblocks.7.mlp.c_fc.weight torch.Size([4096, 1024])
visual.transformer.resblocks.7.mlp.c_fc.bias torch.Size([4096])
visual.transformer.resblocks.7.mlp.c_proj.weight torch.Size([1024, 4096])
visual.transformer.resblocks.7.mlp.c_proj.bias torch.Size([1024])
visual.transformer.resblocks.7.ln_2.weight torch.Size([1024])
visual.transformer.resblocks.7.ln_2.bias torch.Size([1024])
visual.transformer.resblocks.8.attn.in_proj_weight torch.Size([3072, 1024])
visual.transformer.resblocks.8.attn.in_proj_bias torch.Size([3072])
visual.transformer.resblocks.8.attn.out_proj.weight torch.Size([1024, 1024])
visual.transformer.resblocks.8.attn.out_proj.bias torch.Size([1024])
visual.transformer.resblocks.8.ln_1.weight torch.Size([1024])
visual.transformer.resblocks.8.ln_1.bias torch.Size([1024])
visual.transformer.resblocks.8.mlp.c_fc.weight torch.Size([4096, 1024])
visual.transformer.resblocks.8.mlp.c_fc.bias torch.Size([4096])
visual.transformer.resblocks.8.mlp.c_proj.weight torch.Size([1024, 4096])
visual.transformer.resblocks.8.mlp.c_proj.bias torch.Size([1024])
visual.transformer.resblocks.8.ln_2.weight torch.Size([1024])
visual.transformer.resblocks.8.ln_2.bias torch.Size([1024])
visual.transformer.resblocks.9.attn.in_proj_weight torch.Size([3072, 1024])
visual.transformer.resblocks.9.attn.in_proj_bias torch.Size([3072])
visual.transformer.resblocks.9.attn.out_proj.weight torch.Size([1024, 1024])
visual.transformer.resblocks.9.attn.out_proj.bias torch.Size([1024])
visual.transformer.resblocks.9.ln_1.weight torch.Size([1024])
visual.transformer.resblocks.9.ln_1.bias torch.Size([1024])
visual.transformer.resblocks.9.mlp.c_fc.weight torch.Size([4096, 1024])
visual.transformer.resblocks.9.mlp.c_fc.bias torch.Size([4096])
visual.transformer.resblocks.9.mlp.c_proj.weight torch.Size([1024, 4096])
visual.transformer.resblocks.9.mlp.c_proj.bias torch.Size([1024])
visual.transformer.resblocks.9.ln_2.weight torch.Size([1024])
visual.transformer.resblocks.9.ln_2.bias torch.Size([1024])
visual.transformer.resblocks.10.attn.in_proj_weight torch.Size([3072, 1024])
visual.transformer.resblocks.10.attn.in_proj_bias torch.Size([3072])
visual.transformer.resblocks.10.attn.out_proj.weight torch.Size([1024, 1024])
visual.transformer.resblocks.10.attn.out_proj.bias torch.Size([1024])
visual.transformer.resblocks.10.ln_1.weight torch.Size([1024])
visual.transformer.resblocks.10.ln_1.bias torch.Size([1024])
visual.transformer.resblocks.10.mlp.c_fc.weight torch.Size([4096, 1024])
visual.transformer.resblocks.10.mlp.c_fc.bias torch.Size([4096])
visual.transformer.resblocks.10.mlp.c_proj.weight torch.Size([1024, 4096])
visual.transformer.resblocks.10.mlp.c_proj.bias torch.Size([1024])
visual.transformer.resblocks.10.ln_2.weight torch.Size([1024])
visual.transformer.resblocks.10.ln_2.bias torch.Size([1024])
visual.transformer.resblocks.11.attn.in_proj_weight torch.Size([3072, 1024])
visual.transformer.resblocks.11.attn.in_proj_bias torch.Size([3072])
visual.transformer.resblocks.11.attn.out_proj.weight torch.Size([1024, 1024])
visual.transformer.resblocks.11.attn.out_proj.bias torch.Size([1024])
visual.transformer.resblocks.11.ln_1.weight torch.Size([1024])
visual.transformer.resblocks.11.ln_1.bias torch.Size([1024])
visual.transformer.resblocks.11.mlp.c_fc.weight torch.Size([4096, 1024])
visual.transformer.resblocks.11.mlp.c_fc.bias torch.Size([4096])
visual.transformer.resblocks.11.mlp.c_proj.weight torch.Size([1024, 4096])
visual.transformer.resblocks.11.mlp.c_proj.bias torch.Size([1024])
visual.transformer.resblocks.11.ln_2.weight torch.Size([1024])
visual.transformer.resblocks.11.ln_2.bias torch.Size([1024])
visual.transformer.resblocks.12.attn.in_proj_weight torch.Size([3072, 1024])
visual.transformer.resblocks.12.attn.in_proj_bias torch.Size([3072])
visual.transformer.resblocks.12.attn.out_proj.weight torch.Size([1024, 1024])
visual.transformer.resblocks.12.attn.out_proj.bias torch.Size([1024])
visual.transformer.resblocks.12.ln_1.weight torch.Size([1024])
visual.transformer.resblocks.12.ln_1.bias torch.Size([1024])
visual.transformer.resblocks.12.mlp.c_fc.weight torch.Size([4096, 1024])
visual.transformer.resblocks.12.mlp.c_fc.bias torch.Size([4096])
visual.transformer.resblocks.12.mlp.c_proj.weight torch.Size([1024, 4096])
visual.transformer.resblocks.12.mlp.c_proj.bias torch.Size([1024])
visual.transformer.resblocks.12.ln_2.weight torch.Size([1024])
visual.transformer.resblocks.12.ln_2.bias torch.Size([1024])
visual.transformer.resblocks.13.attn.in_proj_weight torch.Size([3072, 1024])
visual.transformer.resblocks.13.attn.in_proj_bias torch.Size([3072])
visual.transformer.resblocks.13.attn.out_proj.weight torch.Size([1024, 1024])
visual.transformer.resblocks.13.attn.out_proj.bias torch.Size([1024])
visual.transformer.resblocks.13.ln_1.weight torch.Size([1024])
visual.transformer.resblocks.13.ln_1.bias torch.Size([1024])
visual.transformer.resblocks.13.mlp.c_fc.weight torch.Size([4096, 1024])
visual.transformer.resblocks.13.mlp.c_fc.bias torch.Size([4096])
visual.transformer.resblocks.13.mlp.c_proj.weight torch.Size([1024, 4096])
visual.transformer.resblocks.13.mlp.c_proj.bias torch.Size([1024])
visual.transformer.resblocks.13.ln_2.weight torch.Size([1024])
visual.transformer.resblocks.13.ln_2.bias torch.Size([1024])
visual.transformer.resblocks.14.attn.in_proj_weight torch.Size([3072, 1024])
visual.transformer.resblocks.14.attn.in_proj_bias torch.Size([3072])
visual.transformer.resblocks.14.attn.out_proj.weight torch.Size([1024, 1024])
visual.transformer.resblocks.14.attn.out_proj.bias torch.Size([1024])
visual.transformer.resblocks.14.ln_1.weight torch.Size([1024])
visual.transformer.resblocks.14.ln_1.bias torch.Size([1024])
visual.transformer.resblocks.14.mlp.c_fc.weight torch.Size([4096, 1024])
visual.transformer.resblocks.14.mlp.c_fc.bias torch.Size([4096])
visual.transformer.resblocks.14.mlp.c_proj.weight torch.Size([1024, 4096])
visual.transformer.resblocks.14.mlp.c_proj.bias torch.Size([1024])
visual.transformer.resblocks.14.ln_2.weight torch.Size([1024])
visual.transformer.resblocks.14.ln_2.bias torch.Size([1024])
visual.transformer.resblocks.15.attn.in_proj_weight torch.Size([3072, 1024])
visual.transformer.resblocks.15.attn.in_proj_bias torch.Size([3072])
visual.transformer.resblocks.15.attn.out_proj.weight torch.Size([1024, 1024])
visual.transformer.resblocks.15.attn.out_proj.bias torch.Size([1024])
visual.transformer.resblocks.15.ln_1.weight torch.Size([1024])
visual.transformer.resblocks.15.ln_1.bias torch.Size([1024])
visual.transformer.resblocks.15.mlp.c_fc.weight torch.Size([4096, 1024])
visual.transformer.resblocks.15.mlp.c_fc.bias torch.Size([4096])
visual.transformer.resblocks.15.mlp.c_proj.weight torch.Size([1024, 4096])
visual.transformer.resblocks.15.mlp.c_proj.bias torch.Size([1024])
visual.transformer.resblocks.15.ln_2.weight torch.Size([1024])
visual.transformer.resblocks.15.ln_2.bias torch.Size([1024])
visual.transformer.resblocks.16.attn.in_proj_weight torch.Size([3072, 1024])
visual.transformer.resblocks.16.attn.in_proj_bias torch.Size([3072])
visual.transformer.resblocks.16.attn.out_proj.weight torch.Size([1024, 1024])
visual.transformer.resblocks.16.attn.out_proj.bias torch.Size([1024])
visual.transformer.resblocks.16.ln_1.weight torch.Size([1024])
visual.transformer.resblocks.16.ln_1.bias torch.Size([1024])
visual.transformer.resblocks.16.mlp.c_fc.weight torch.Size([4096, 1024])
visual.transformer.resblocks.16.mlp.c_fc.bias torch.Size([4096])
visual.transformer.resblocks.16.mlp.c_proj.weight torch.Size([1024, 4096])
visual.transformer.resblocks.16.mlp.c_proj.bias torch.Size([1024])
visual.transformer.resblocks.16.ln_2.weight torch.Size([1024])
visual.transformer.resblocks.16.ln_2.bias torch.Size([1024])
visual.transformer.resblocks.17.attn.in_proj_weight torch.Size([3072, 1024])
visual.transformer.resblocks.17.attn.in_proj_bias torch.Size([3072])
visual.transformer.resblocks.17.attn.out_proj.weight torch.Size([1024, 1024])
visual.transformer.resblocks.17.attn.out_proj.bias torch.Size([1024])
visual.transformer.resblocks.17.ln_1.weight torch.Size([1024])
visual.transformer.resblocks.17.ln_1.bias torch.Size([1024])
visual.transformer.resblocks.17.mlp.c_fc.weight torch.Size([4096, 1024])
visual.transformer.resblocks.17.mlp.c_fc.bias torch.Size([4096])
visual.transformer.resblocks.17.mlp.c_proj.weight torch.Size([1024, 4096])
visual.transformer.resblocks.17.mlp.c_proj.bias torch.Size([1024])
visual.transformer.resblocks.17.ln_2.weight torch.Size([1024])
visual.transformer.resblocks.17.ln_2.bias torch.Size([1024])
visual.transformer.resblocks.18.attn.in_proj_weight torch.Size([3072, 1024])
visual.transformer.resblocks.18.attn.in_proj_bias torch.Size([3072])
visual.transformer.resblocks.18.attn.out_proj.weight torch.Size([1024, 1024])
visual.transformer.resblocks.18.attn.out_proj.bias torch.Size([1024])
visual.transformer.resblocks.18.ln_1.weight torch.Size([1024])
visual.transformer.resblocks.18.ln_1.bias torch.Size([1024])
visual.transformer.resblocks.18.mlp.c_fc.weight torch.Size([4096, 1024])
visual.transformer.resblocks.18.mlp.c_fc.bias torch.Size([4096])
visual.transformer.resblocks.18.mlp.c_proj.weight torch.Size([1024, 4096])
visual.transformer.resblocks.18.mlp.c_proj.bias torch.Size([1024])
visual.transformer.resblocks.18.ln_2.weight torch.Size([1024])
visual.transformer.resblocks.18.ln_2.bias torch.Size([1024])
visual.transformer.resblocks.19.attn.in_proj_weight torch.Size([3072, 1024])
visual.transformer.resblocks.19.attn.in_proj_bias torch.Size([3072])
visual.transformer.resblocks.19.attn.out_proj.weight torch.Size([1024, 1024])
visual.transformer.resblocks.19.attn.out_proj.bias torch.Size([1024])
visual.transformer.resblocks.19.ln_1.weight torch.Size([1024])
visual.transformer.resblocks.19.ln_1.bias torch.Size([1024])
visual.transformer.resblocks.19.mlp.c_fc.weight torch.Size([4096, 1024])
visual.transformer.resblocks.19.mlp.c_fc.bias torch.Size([4096])
visual.transformer.resblocks.19.mlp.c_proj.weight torch.Size([1024, 4096])
visual.transformer.resblocks.19.mlp.c_proj.bias torch.Size([1024])
visual.transformer.resblocks.19.ln_2.weight torch.Size([1024])
visual.transformer.resblocks.19.ln_2.bias torch.Size([1024])
visual.transformer.resblocks.20.attn.in_proj_weight torch.Size([3072, 1024])
visual.transformer.resblocks.20.attn.in_proj_bias torch.Size([3072])
visual.transformer.resblocks.20.attn.out_proj.weight torch.Size([1024, 1024])
visual.transformer.resblocks.20.attn.out_proj.bias torch.Size([1024])
visual.transformer.resblocks.20.ln_1.weight torch.Size([1024])
visual.transformer.resblocks.20.ln_1.bias torch.Size([1024])
visual.transformer.resblocks.20.mlp.c_fc.weight torch.Size([4096, 1024])
visual.transformer.resblocks.20.mlp.c_fc.bias torch.Size([4096])
visual.transformer.resblocks.20.mlp.c_proj.weight torch.Size([1024, 4096])
visual.transformer.resblocks.20.mlp.c_proj.bias torch.Size([1024])
visual.transformer.resblocks.20.ln_2.weight torch.Size([1024])
visual.transformer.resblocks.20.ln_2.bias torch.Size([1024])
visual.transformer.resblocks.21.attn.in_proj_weight torch.Size([3072, 1024])
visual.transformer.resblocks.21.attn.in_proj_bias torch.Size([3072])
visual.transformer.resblocks.21.attn.out_proj.weight torch.Size([1024, 1024])
visual.transformer.resblocks.21.attn.out_proj.bias torch.Size([1024])
visual.transformer.resblocks.21.ln_1.weight torch.Size([1024])
visual.transformer.resblocks.21.ln_1.bias torch.Size([1024])
visual.transformer.resblocks.21.mlp.c_fc.weight torch.Size([4096, 1024])
visual.transformer.resblocks.21.mlp.c_fc.bias torch.Size([4096])
visual.transformer.resblocks.21.mlp.c_proj.weight torch.Size([1024, 4096])
visual.transformer.resblocks.21.mlp.c_proj.bias torch.Size([1024])
visual.transformer.resblocks.21.ln_2.weight torch.Size([1024])
visual.transformer.resblocks.21.ln_2.bias torch.Size([1024])
visual.transformer.resblocks.22.attn.in_proj_weight torch.Size([3072, 1024])
visual.transformer.resblocks.22.attn.in_proj_bias torch.Size([3072])
visual.transformer.resblocks.22.attn.out_proj.weight torch.Size([1024, 1024])
visual.transformer.resblocks.22.attn.out_proj.bias torch.Size([1024])
visual.transformer.resblocks.22.ln_1.weight torch.Size([1024])
visual.transformer.resblocks.22.ln_1.bias torch.Size([1024])
visual.transformer.resblocks.22.mlp.c_fc.weight torch.Size([4096, 1024])
visual.transformer.resblocks.22.mlp.c_fc.bias torch.Size([4096])
visual.transformer.resblocks.22.mlp.c_proj.weight torch.Size([1024, 4096])
visual.transformer.resblocks.22.mlp.c_proj.bias torch.Size([1024])
visual.transformer.resblocks.22.ln_2.weight torch.Size([1024])
visual.transformer.resblocks.22.ln_2.bias torch.Size([1024])
visual.transformer.resblocks.23.attn.in_proj_weight torch.Size([3072, 1024])
visual.transformer.resblocks.23.attn.in_proj_bias torch.Size([3072])
visual.transformer.resblocks.23.attn.out_proj.weight torch.Size([1024, 1024])
visual.transformer.resblocks.23.attn.out_proj.bias torch.Size([1024])
visual.transformer.resblocks.23.ln_1.weight torch.Size([1024])
visual.transformer.resblocks.23.ln_1.bias torch.Size([1024])
visual.transformer.resblocks.23.mlp.c_fc.weight torch.Size([4096, 1024])
visual.transformer.resblocks.23.mlp.c_fc.bias torch.Size([4096])
visual.transformer.resblocks.23.mlp.c_proj.weight torch.Size([1024, 4096])
visual.transformer.resblocks.23.mlp.c_proj.bias torch.Size([1024])
visual.transformer.resblocks.23.ln_2.weight torch.Size([1024])
visual.transformer.resblocks.23.ln_2.bias torch.Size([1024])
visual.ln_post.weight torch.Size([1024])
visual.ln_post.bias torch.Size([1024])
transformer.resblocks.0.attn.in_proj_weight torch.Size([2304, 768])
transformer.resblocks.0.attn.in_proj_bias torch.Size([2304])
transformer.resblocks.0.attn.out_proj.weight torch.Size([768, 768])
transformer.resblocks.0.attn.out_proj.bias torch.Size([768])
transformer.resblocks.0.ln_1.weight torch.Size([768])
transformer.resblocks.0.ln_1.bias torch.Size([768])
transformer.resblocks.0.mlp.c_fc.weight torch.Size([3072, 768])
transformer.resblocks.0.mlp.c_fc.bias torch.Size([3072])
transformer.resblocks.0.mlp.c_proj.weight torch.Size([768, 3072])
transformer.resblocks.0.mlp.c_proj.bias torch.Size([768])
transformer.resblocks.0.ln_2.weight torch.Size([768])
transformer.resblocks.0.ln_2.bias torch.Size([768])
transformer.resblocks.1.attn.in_proj_weight torch.Size([2304, 768])
transformer.resblocks.1.attn.in_proj_bias torch.Size([2304])
transformer.resblocks.1.attn.out_proj.weight torch.Size([768, 768])
transformer.resblocks.1.attn.out_proj.bias torch.Size([768])
transformer.resblocks.1.ln_1.weight torch.Size([768])
transformer.resblocks.1.ln_1.bias torch.Size([768])
transformer.resblocks.1.mlp.c_fc.weight torch.Size([3072, 768])
transformer.resblocks.1.mlp.c_fc.bias torch.Size([3072])
transformer.resblocks.1.mlp.c_proj.weight torch.Size([768, 3072])
transformer.resblocks.1.mlp.c_proj.bias torch.Size([768])
transformer.resblocks.1.ln_2.weight torch.Size([768])
transformer.resblocks.1.ln_2.bias torch.Size([768])
transformer.resblocks.2.attn.in_proj_weight torch.Size([2304, 768])
transformer.resblocks.2.attn.in_proj_bias torch.Size([2304])
transformer.resblocks.2.attn.out_proj.weight torch.Size([768, 768])
transformer.resblocks.2.attn.out_proj.bias torch.Size([768])
transformer.resblocks.2.ln_1.weight torch.Size([768])
transformer.resblocks.2.ln_1.bias torch.Size([768])
transformer.resblocks.2.mlp.c_fc.weight torch.Size([3072, 768])
transformer.resblocks.2.mlp.c_fc.bias torch.Size([3072])
transformer.resblocks.2.mlp.c_proj.weight torch.Size([768, 3072])
transformer.resblocks.2.mlp.c_proj.bias torch.Size([768])
transformer.resblocks.2.ln_2.weight torch.Size([768])
transformer.resblocks.2.ln_2.bias torch.Size([768])
transformer.resblocks.3.attn.in_proj_weight torch.Size([2304, 768])
transformer.resblocks.3.attn.in_proj_bias torch.Size([2304])
transformer.resblocks.3.attn.out_proj.weight torch.Size([768, 768])
transformer.resblocks.3.attn.out_proj.bias torch.Size([768])
transformer.resblocks.3.ln_1.weight torch.Size([768])
transformer.resblocks.3.ln_1.bias torch.Size([768])
transformer.resblocks.3.mlp.c_fc.weight torch.Size([3072, 768])
transformer.resblocks.3.mlp.c_fc.bias torch.Size([3072])
transformer.resblocks.3.mlp.c_proj.weight torch.Size([768, 3072])
transformer.resblocks.3.mlp.c_proj.bias torch.Size([768])
transformer.resblocks.3.ln_2.weight torch.Size([768])
transformer.resblocks.3.ln_2.bias torch.Size([768])
transformer.resblocks.4.attn.in_proj_weight torch.Size([2304, 768])
transformer.resblocks.4.attn.in_proj_bias torch.Size([2304])
transformer.resblocks.4.attn.out_proj.weight torch.Size([768, 768])
transformer.resblocks.4.attn.out_proj.bias torch.Size([768])
transformer.resblocks.4.ln_1.weight torch.Size([768])
transformer.resblocks.4.ln_1.bias torch.Size([768])
transformer.resblocks.4.mlp.c_fc.weight torch.Size([3072, 768])
transformer.resblocks.4.mlp.c_fc.bias torch.Size([3072])
transformer.resblocks.4.mlp.c_proj.weight torch.Size([768, 3072])
transformer.resblocks.4.mlp.c_proj.bias torch.Size([768])
transformer.resblocks.4.ln_2.weight torch.Size([768])
transformer.resblocks.4.ln_2.bias torch.Size([768])
transformer.resblocks.5.attn.in_proj_weight torch.Size([2304, 768])
transformer.resblocks.5.attn.in_proj_bias torch.Size([2304])
transformer.resblocks.5.attn.out_proj.weight torch.Size([768, 768])
transformer.resblocks.5.attn.out_proj.bias torch.Size([768])
transformer.resblocks.5.ln_1.weight torch.Size([768])
transformer.resblocks.5.ln_1.bias torch.Size([768])
transformer.resblocks.5.mlp.c_fc.weight torch.Size([3072, 768])
transformer.resblocks.5.mlp.c_fc.bias torch.Size([3072])
transformer.resblocks.5.mlp.c_proj.weight torch.Size([768, 3072])
transformer.resblocks.5.mlp.c_proj.bias torch.Size([768])
transformer.resblocks.5.ln_2.weight torch.Size([768])
transformer.resblocks.5.ln_2.bias torch.Size([768])
transformer.resblocks.6.attn.in_proj_weight torch.Size([2304, 768])
transformer.resblocks.6.attn.in_proj_bias torch.Size([2304])
transformer.resblocks.6.attn.out_proj.weight torch.Size([768, 768])
transformer.resblocks.6.attn.out_proj.bias torch.Size([768])
transformer.resblocks.6.ln_1.weight torch.Size([768])
transformer.resblocks.6.ln_1.bias torch.Size([768])
transformer.resblocks.6.mlp.c_fc.weight torch.Size([3072, 768])
transformer.resblocks.6.mlp.c_fc.bias torch.Size([3072])
transformer.resblocks.6.mlp.c_proj.weight torch.Size([768, 3072])
transformer.resblocks.6.mlp.c_proj.bias torch.Size([768])
transformer.resblocks.6.ln_2.weight torch.Size([768])
transformer.resblocks.6.ln_2.bias torch.Size([768])
transformer.resblocks.7.attn.in_proj_weight torch.Size([2304, 768])
transformer.resblocks.7.attn.in_proj_bias torch.Size([2304])
transformer.resblocks.7.attn.out_proj.weight torch.Size([768, 768])
transformer.resblocks.7.attn.out_proj.bias torch.Size([768])
transformer.resblocks.7.ln_1.weight torch.Size([768])
transformer.resblocks.7.ln_1.bias torch.Size([768])
transformer.resblocks.7.mlp.c_fc.weight torch.Size([3072, 768])
transformer.resblocks.7.mlp.c_fc.bias torch.Size([3072])
transformer.resblocks.7.mlp.c_proj.weight torch.Size([768, 3072])
transformer.resblocks.7.mlp.c_proj.bias torch.Size([768])
transformer.resblocks.7.ln_2.weight torch.Size([768])
transformer.resblocks.7.ln_2.bias torch.Size([768])
transformer.resblocks.8.attn.in_proj_weight torch.Size([2304, 768])
transformer.resblocks.8.attn.in_proj_bias torch.Size([2304])
transformer.resblocks.8.attn.out_proj.weight torch.Size([768, 768])
transformer.resblocks.8.attn.out_proj.bias torch.Size([768])
transformer.resblocks.8.ln_1.weight torch.Size([768])
transformer.resblocks.8.ln_1.bias torch.Size([768])
transformer.resblocks.8.mlp.c_fc.weight torch.Size([3072, 768])
transformer.resblocks.8.mlp.c_fc.bias torch.Size([3072])
transformer.resblocks.8.mlp.c_proj.weight torch.Size([768, 3072])
transformer.resblocks.8.mlp.c_proj.bias torch.Size([768])
transformer.resblocks.8.ln_2.weight torch.Size([768])
transformer.resblocks.8.ln_2.bias torch.Size([768])
transformer.resblocks.9.attn.in_proj_weight torch.Size([2304, 768])
transformer.resblocks.9.attn.in_proj_bias torch.Size([2304])
transformer.resblocks.9.attn.out_proj.weight torch.Size([768, 768])
transformer.resblocks.9.attn.out_proj.bias torch.Size([768])
transformer.resblocks.9.ln_1.weight torch.Size([768])
transformer.resblocks.9.ln_1.bias torch.Size([768])
transformer.resblocks.9.mlp.c_fc.weight torch.Size([3072, 768])
transformer.resblocks.9.mlp.c_fc.bias torch.Size([3072])
transformer.resblocks.9.mlp.c_proj.weight torch.Size([768, 3072])
transformer.resblocks.9.mlp.c_proj.bias torch.Size([768])
transformer.resblocks.9.ln_2.weight torch.Size([768])
transformer.resblocks.9.ln_2.bias torch.Size([768])
transformer.resblocks.10.attn.in_proj_weight torch.Size([2304, 768])
transformer.resblocks.10.attn.in_proj_bias torch.Size([2304])
transformer.resblocks.10.attn.out_proj.weight torch.Size([768, 768])
transformer.resblocks.10.attn.out_proj.bias torch.Size([768])
transformer.resblocks.10.ln_1.weight torch.Size([768])
transformer.resblocks.10.ln_1.bias torch.Size([768])
transformer.resblocks.10.mlp.c_fc.weight torch.Size([3072, 768])
transformer.resblocks.10.mlp.c_fc.bias torch.Size([3072])
transformer.resblocks.10.mlp.c_proj.weight torch.Size([768, 3072])
transformer.resblocks.10.mlp.c_proj.bias torch.Size([768])
transformer.resblocks.10.ln_2.weight torch.Size([768])
transformer.resblocks.10.ln_2.bias torch.Size([768])
transformer.resblocks.11.attn.in_proj_weight torch.Size([2304, 768])
transformer.resblocks.11.attn.in_proj_bias torch.Size([2304])
transformer.resblocks.11.attn.out_proj.weight torch.Size([768, 768])
transformer.resblocks.11.attn.out_proj.bias torch.Size([768])
transformer.resblocks.11.ln_1.weight torch.Size([768])
transformer.resblocks.11.ln_1.bias torch.Size([768])
transformer.resblocks.11.mlp.c_fc.weight torch.Size([3072, 768])
transformer.resblocks.11.mlp.c_fc.bias torch.Size([3072])
transformer.resblocks.11.mlp.c_proj.weight torch.Size([768, 3072])
transformer.resblocks.11.mlp.c_proj.bias torch.Size([768])
transformer.resblocks.11.ln_2.weight torch.Size([768])
transformer.resblocks.11.ln_2.bias torch.Size([768])
token_embedding.weight torch.Size([49408, 768])
ln_final.weight torch.Size([768])
ln_final.bias torch.Size([768])
